# IsItemVisible

## Description
Determines if the specified item is currently visible.

```pascal
FUNCTION IsItemVisible(
				nDialogID    : LONGINT;
				nComponentID : LONGINT) : BOOLEAN;
```

```python

def vs.IsItemVisible(nDialogID, nComponentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern